## Plan Result (v3-proxy-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11222546223)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.otel-collector-log-group
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
* Delete
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/V3ProxyApi-Prod/ecs/otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4030/.well-known/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/v3proxyapi-prod-app:latest"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/V3ProxyApi-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4030
                          + hostPort      = 4030
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/V3ProxyApi/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "UNLEASH_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                      + {
                          + name      = "UNLEASH_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:V3ProxyApi/Prod/UNLEASH_KEY"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
              + {
                  + environment            = [
                      + {
                          + name  = "DEPLOYMENT_ENVIRONMENT_NAME"
                          + value = "prod"
                        },
                    ]
                  + essential              = true
                  + image                  = "pocket/opentelemetry-collector-contrib"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/V3ProxyApi-Prod/ecs/otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "otel-collector"
                  + portMappings           = [
                      + {
                          + containerPort = 4138
                          + hostPort      = 4138
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 55681
                          + hostPort      = 55681
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + secrets                = [
                      + {
                          + name      = "GOOGLE_APPLICATION_CREDENTIALS_JSON"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/GCP_SA_TRACES:::"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/V3ProxyApi-Prod-TaskExecutionRole"
      + family                   = "V3ProxyApi-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/V3ProxyApi-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be destroyed
  # (because aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 is not in configuration)
  - resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      - arn              = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - name             = "V3ProxyApi-Prod-TaskRolePolicy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA6QHBNZIQ3QEBYOKRS" -> null
      - tags             = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-v3proxyapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "V3ProxyApi"
        } -> null
      - tags_all         = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-v3proxyapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "V3ProxyApi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be destroyed
  # (because aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      - id         = "V3ProxyApi-Prod-TaskRole-20241007192539610200000001" -> null
      - policy_arn = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - role       = "V3ProxyApi-Prod-TaskRole" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:319" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":800,"Program":"tfcmt","SHA1":"03b3d844bbcfde0f275225af5c0ff3b550a7c85b","Target":"v3-proxy-api-cdk-production","Vars":{},"WorkflowName":"V3 Proxy API"} -->